# Part 4 Maji Ndogo project: Charting the course for Maji Ndogo's water future

This marks the final analysis where we will craft data driven solutions for Maji Ndogo water crisis. 

The project Objectives:

1. joining the pieces together:finding the data we need across the different tables into 1

    2. finding our final instights

    3. summary report: sharing our insights

    4. data driven action plan

    5. generating a Project_progress table

In [2]:
# load sql extension for magic commands
%load_ext sql

In [3]:
# connect to mysql database 
%sql mysql+pymysql://root:12345678@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [18]:
%%sql
-- select province,town,visit count, location id by joining locations table to visits
SELECT
  l.province_name,
  l.town_name,
  v.visit_count,
  l.location_id
FROM
  visits v
  LEFT JOIN location l ON l.location_id = V.location_id

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

60146 rows affected.

+---------------+-----------+-------------+-------------+
| province_name | town_name | visit_count | location_id |
+---------------+-----------+-------------+-------------+
|     Sokoto    |   Ilanga  |      1      |  SoIl32582  |
|    Kilimani   |   Rural   |      1      |  KiRu28935  |
|    Hawassa    |   Rural   |      1      |  HaRu19752  |
|     Akatsi    |   Lusaka  |      1      |  AkLu01628  |
|     Akatsi    |   Rural   |      1      |  AkRu03357  |
|    Kilimani   |   Rural   |      1      |  KiRu29315  |
|     Akatsi    |   Rural   |      1      |  AkRu05234  |
|    Kilimani   |   Rural   |      1      |  KiRu28520  |
|    Hawassa    |  Zanzibar |      1      |  HaZa21742  |
|     Amanzi    |   Dahabu  |      1      |  AmDa12214  |
+---------------+-----------+-------------+-------------+
Truncated to displaylimit of 10.

In [19]:
%%sql
-- add the type_of_water_source, number_of_people_served from the sources tables
SELECT
  l.province_name,
  l.town_name,
  v.visit_count,
  l.location_id,
  s.type_of_water_source,
  s.number_of_people_served
FROM
  visits v
  INNER JOIN location l ON l.location_id = v.location_id
  INNER JOIN water_source s ON s.source_id = v.source_id

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

60146 rows affected.

+---------------+-----------+-------------+-------------+----------------------+-------------------------+
| province_name | town_name | visit_count | location_id | type_of_water_source | number_of_people_served |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+
|     Akatsi    |   Harare  |      1      |  AkHa00000  |     tap_in_home      |           956           |
|     Akatsi    |   Harare  |      1      |  AkHa00001  |  tap_in_home_broken  |           930           |
|     Akatsi    |   Harare  |      1      |  AkHa00002  |  tap_in_home_broken  |           486           |
|     Akatsi    |   Harare  |      1      |  AkHa00003  |         well         |           364           |
|     Akatsi    |   Harare  |      1      |  AkHa00004  |  tap_in_home_broken  |           942           |
|     Akatsi    |   Harare  |      1      |  AkHa00005  |     tap_in_home      |           736           |
|     Akatsi    |   Harare  |      1      |  AkHa00006  |     tap_in_home      |           882           |
|     Akatsi    |   Harare  |      1      |  AkHa00007  |     tap_in_home      |           554           |
|     Akatsi    |   Harare  |      1      |  AkHa00008  |         well         |           398           |
|     Akatsi    |   Harare  |      1      |  AkHa00009  |         well         |           346           |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+
Truncated to displaylimit of 10.

In [20]:
%%sql
-- filter out locations which were visited more than 1 time i.e they are duplicates
-- insert the time_in_queue column from the visits table
SELECT
  l.province_name,
  l.town_name,
  v.visit_count,
  l.location_id,
  s.type_of_water_source,
  s.number_of_people_served,
  v.time_in_queue -- additional column
FROM
  visits v
  INNER JOIN location l ON l.location_id = v.location_id
  INNER JOIN water_source s ON s.source_id = v.source_id
WHERE -- insert the filter 
  v.visit_count = 1;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

39650 rows affected.

+---------------+-----------+-------------+-------------+----------------------+-------------------------+---------------+
| province_name | town_name | visit_count | location_id | type_of_water_source | number_of_people_served | time_in_queue |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+---------------+
|     Sokoto    |   Ilanga  |      1      |  SoIl32582  |        river         |           402           |       15      |
|    Kilimani   |   Rural   |      1      |  KiRu28935  |         well         |           252           |       0       |
|    Hawassa    |   Rural   |      1      |  HaRu19752  |      shared_tap      |           542           |       62      |
|     Akatsi    |   Lusaka  |      1      |  AkLu01628  |         well         |           210           |       0       |
|     Akatsi    |   Rural   |      1      |  AkRu03357  |      shared_tap      |           2598          |       28      |
|    Kilimani   |   Rural   |      1      |  KiRu29315  |        river         |           862           |       9       |
|     Akatsi    |   Rural   |      1      |  AkRu05234  |  tap_in_home_broken  |           496           |       0       |
|    Kilimani   |   Rural   |      1      |  KiRu28520  |     tap_in_home      |           562           |       0       |
|    Hawassa    |  Zanzibar |      1      |  HaZa21742  |         well         |           308           |       0       |
|     Amanzi    |   Dahabu  |      1      |  AmDa12214  |     tap_in_home      |           556           |       0       |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+---------------+
Truncated to displaylimit of 10.

In [21]:
%%sql
-- add pollution column using left join because the well_pollution table only has data on wells
SELECT
  l.province_name,
  l.town_name,
  v.visit_count,
  l.location_id,
  s.type_of_water_source,
  s.number_of_people_served,
  v.time_in_queue,
  p.results
FROM
  visits v
  INNER JOIN location l ON l.location_id = v.location_id
  INNER JOIN water_source s ON s.source_id = v.source_id
  LEFT JOIN -- join the well_pollution table on the visits table on source_id
  well_pollution p ON p.source_id = v.source_id
WHERE -- insert the filter 
  v.visit_count = 1;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

39650 rows affected.

+---------------+-----------+-------------+-------------+----------------------+-------------------------+---------------+--------------------------+
| province_name | town_name | visit_count | location_id | type_of_water_source | number_of_people_served | time_in_queue |         results          |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+---------------+--------------------------+
|     Sokoto    |   Ilanga  |      1      |  SoIl32582  |        river         |           402           |       15      |           None           |
|    Kilimani   |   Rural   |      1      |  KiRu28935  |         well         |           252           |       0       | Contaminated: Biological |
|    Hawassa    |   Rural   |      1      |  HaRu19752  |      shared_tap      |           542           |       62      |           None           |
|     Akatsi    |   Lusaka  |      1      |  AkLu01628  |         well         |           210           |       0       | Contaminated: Biological |
|     Akatsi    |   Rural   |      1      |  AkRu03357  |      shared_tap      |           2598          |       28      |           None           |
|    Kilimani   |   Rural   |      1      |  KiRu29315  |        river         |           862           |       9       |           None           |
|     Akatsi    |   Rural   |      1      |  AkRu05234  |  tap_in_home_broken  |           496           |       0       |           None           |
|    Kilimani   |   Rural   |      1      |  KiRu28520  |     tap_in_home      |           562           |       0       |           None           |
|    Hawassa    |  Zanzibar |      1      |  HaZa21742  |         well         |           308           |       0       |  Contaminated: Chemical  |
|     Amanzi    |   Dahabu  |      1      |  AmDa12214  |     tap_in_home      |           556           |       0       |           None           |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+---------------+--------------------------+
Truncated to displaylimit of 10.

In [22]:
%%sql
-- create a view of the query for persistence and querying later
CREATE VIEW
  combined_analysis_table AS
SELECT
  l.province_name,
  l.town_name,
  v.visit_count,
  l.location_id,
  s.type_of_water_source,
  s.number_of_people_served,
  v.time_in_queue,
  p.results
FROM
  visits v
  INNER JOIN location l ON l.location_id = v.location_id
  INNER JOIN water_source s ON s.source_id = v.source_id
  LEFT JOIN -- join the well_pollution table on the visits table on source_id
  well_pollution p ON p.source_id = v.source_id
WHERE -- insert the filter 
  v.visit_count = 1;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

++
||
++
++

### Last Analysis

In [26]:
%%sql
-- calculate the total pop of maji ndogo using the sum of people served by diff water sources
WITH
  province_totals AS ( -- This CTE calculates the population of each province
    SELECT
      province_name,
      SUM(number_of_people_served) AS total_ppl_serv
    FROM
      combined_analysis_table
    GROUP BY
      province_name
  )
SELECT
  *
FROM
  province_totals;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+----------------+
| province_name | total_ppl_serv |
+---------------+----------------+
|     Sokoto    |    5774434     |
|    Kilimani   |    6584764     |
|    Hawassa    |    3843810     |
|     Akatsi    |    5993306     |
|     Amanzi    |    5431826     |
+---------------+----------------+

In [30]:
%%sql
-- use the CTE created above to create a pivot table on  
WITH province_totals AS (-- This CTE calculates the population of each province
 SELECT
     province_name,
     SUM(number_of_people_served) AS total_ppl_serv
 FROM
     combined_analysis_table
 GROUP BY
     province_name
    )
SELECT
 ct.province_name,-- These case statements create columns for each type of source.-- The results are aggregated and percentages are calculated
 ROUND((SUM(CASE WHEN type_of_water_source = 'river'
 THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS river,
 ROUND((SUM(CASE WHEN type_of_water_source = 'shared_tap'
 THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS shared_tap,
 ROUND((SUM(CASE WHEN type_of_water_source = 'tap_in_home'
 THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS tap_in_home,
 ROUND((SUM(CASE WHEN type_of_water_source = 'tap_in_home_broken'
 THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS tap_in_home_broken,
 ROUND((SUM(CASE WHEN type_of_water_source = 'well'
 THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS well
 FROM
 combined_analysis_table ct
 JOIN
 province_totals pt ON ct.province_name = pt.province_name
 GROUP BY
 ct.province_name
 ORDER BY
 ct.province_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-------+------------+-------------+--------------------+------+
| province_name | river | shared_tap | tap_in_home | tap_in_home_broken | well |
+---------------+-------+------------+-------------+--------------------+------+
|     Akatsi    |   5   |     49     |      14     |         10         |  23  |
|     Amanzi    |   3   |     38     |      28     |         24         |  7   |
|    Hawassa    |   4   |     43     |      15     |         15         |  24  |
|    Kilimani   |   8   |     47     |      13     |         12         |  20  |
|     Sokoto    |   21  |     38     |      16     |         10         |  15  |
+---------------+-------+------------+-------------+--------------------+------+

• The river column, Sokoto has the largest population of people drinking river water. We should send our drilling equipment to Sokoto first, so people can drink safe filtered water from a well.

• The majority of water from Amanzi comes from taps, but half of these home taps don't work because the infrastructure is broken. We need to send out engineering teams to look at the infrastructure in Amanzi first. Fixing a large pump, treatment plant or reservoir means that thousands of people will have running water. This means they will also not have to queue for water, so we improve two things at once

In [35]:
%%sql
-- use the CTE created above to create a pivot table on  
WITH town_totals AS (-- This CTE calculates the population of each town
 --Since there are two Harare towns, we have to group by province_name and town_name
SELECT province_name, town_name, SUM(number_of_people_served) AS total_ppl_serv
FROM combined_analysis_table
GROUP BY province_name,town_name
 )
SELECT
 ct.province_name,
 ct.town_name,
 ROUND((SUM(CASE WHEN type_of_water_source = 'river'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS river,
 ROUND((SUM(CASE WHEN type_of_water_source = 'shared_tap'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS shared_tap,
 ROUND((SUM(CASE WHEN type_of_water_source = 'tap_in_home'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS tap_in_home,
 ROUND((SUM(CASE WHEN type_of_water_source = 'tap_in_home_broken'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS tap_in_home_broken,
 ROUND((SUM(CASE WHEN type_of_water_source = 'well'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS well 
FROM
 combined_analysis_table ct

JOIN --Since the town names are not unique, we have to join on a composite key
 town_totals tt ON ct.province_name = tt.province_name AND ct.town_name = tt.town_name

GROUP BY --We group by province first, then by town.
 ct.province_name,
 ct.town_name
ORDER BY
 ct.town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+-------+------------+-------------+--------------------+------+
| province_name | town_name | river | shared_tap | tap_in_home | tap_in_home_broken | well |
+---------------+-----------+-------+------------+-------------+--------------------+------+
|     Amanzi    |  Abidjan  |   2   |     53     |      22     |         19         |  4   |
|    Kilimani   |   Amara   |   8   |     22     |      25     |         16         |  30  |
|     Amanzi    |   Amina   |   8   |     24     |      3      |         56         |  9   |
|    Hawassa    |   Amina   |   2   |     14     |      19     |         24         |  42  |
|     Amanzi    |   Asmara  |   3   |     49     |      24     |         20         |  4   |
|     Sokoto    |   Bahari  |   21  |     11     |      36     |         12         |  20  |
|     Amanzi    |   Bello   |   3   |     53     |      20     |         22         |  3   |
|     Sokoto    |   Cheche  |   19  |     16     |      35     |         12         |  18  |
|     Amanzi    |   Dahabu  |   3   |     37     |      55     |         1          |  4   |
|    Hawassa    |    Deka   |   3   |     16     |      23     |         21         |  38  |
+---------------+-----------+-------+------------+-------------+--------------------+------+
Truncated to displaylimit of 10.

In [37]:
%%sql 
    -- create a temporary table to store the results of the query
CREATE TEMPORARY TABLE town_aggregated_water_access

WITH town_totals AS (-- This CTE calculates the population of each town
 --Since there are two Harare towns, we have to group by province_name and town_name
SELECT province_name, town_name, SUM(number_of_people_served) AS total_ppl_serv
FROM combined_analysis_table
GROUP BY province_name,town_name
 )
SELECT
 ct.province_name,
 ct.town_name,
 ROUND((SUM(CASE WHEN type_of_water_source = 'river'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS river,
 ROUND((SUM(CASE WHEN type_of_water_source = 'shared_tap'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS shared_tap,
 ROUND((SUM(CASE WHEN type_of_water_source = 'tap_in_home'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS tap_in_home,
 ROUND((SUM(CASE WHEN type_of_water_source = 'tap_in_home_broken'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS tap_in_home_broken,
 ROUND((SUM(CASE WHEN type_of_water_source = 'well'
THEN number_of_people_served ELSE 0 END) * 100.0 / tt.total_ppl_serv), 0) AS well 
FROM
 combined_analysis_table ct

JOIN --Since the town names are not unique, we have to join on a composite key
 town_totals tt ON ct.province_name = tt.province_name AND ct.town_name = tt.town_name

GROUP BY --We group by province first, then by town.
 ct.province_name,
 ct.town_name
ORDER BY
 ct.town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

++
||
++
++

In [39]:
%%sql
-- order river column in the temporary table created
SELECT *
FROM town_aggregated_water_access
ORDER BY river DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+-------+------------+-------------+--------------------+------+
| province_name | town_name | river | shared_tap | tap_in_home | tap_in_home_broken | well |
+---------------+-----------+-------+------------+-------------+--------------------+------+
|     Sokoto    |   Rural   |   22  |     49     |      8      |         8          |  13  |
|     Sokoto    |   Bahari  |   21  |     11     |      36     |         12         |  20  |
|     Sokoto    |    Kofi   |   20  |     16     |      34     |         10         |  20  |
|     Sokoto    |   Cheche  |   19  |     16     |      35     |         12         |  18  |
|     Sokoto    |  Majengo  |   18  |     14     |      36     |         12         |  20  |
|     Sokoto    |   Marang  |   17  |     19     |      31     |         13         |  21  |
|     Sokoto    |   Ilanga  |   16  |     12     |      36     |         15         |  21  |
|    Kilimani   |   Rural   |   9   |     55     |      8      |         9          |  19  |
|    Kilimani   |   Amara   |   8   |     22     |      25     |         16         |  30  |
|     Amanzi    |   Amina   |   8   |     24     |      3      |         56         |  9   |
+---------------+-----------+-------+------------+-------------+--------------------+------+
Truncated to displaylimit of 10.

which town has the highest ratio of people who have taps, but have no running water?

In [40]:
%%sql
SELECT
     province_name,
     town_name,
     ROUND(tap_in_home_broken / (tap_in_home_broken + tap_in_home) * 100,0) AS Pct_broken_taps
FROM
     town_aggregated_water_access

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+-----------------+
| province_name | town_name | Pct_broken_taps |
+---------------+-----------+-----------------+
|     Amanzi    |  Abidjan  |        46       |
|    Kilimani   |   Amara   |        39       |
|     Amanzi    |   Amina   |        95       |
|    Hawassa    |   Amina   |        56       |
|     Amanzi    |   Asmara  |        45       |
|     Sokoto    |   Bahari  |        25       |
|     Amanzi    |   Bello   |        52       |
|     Sokoto    |   Cheche  |        26       |
|     Amanzi    |   Dahabu  |        2        |
|    Hawassa    |    Deka   |        48       |
+---------------+-----------+-----------------+
Truncated to displaylimit of 10.

# Summary report

 Insights
 10:28
 Ok, so let's sum up the data we have.

 1. Most water sources are rural in Maji Ndogo.

 2. 43% of our people are using shared taps. 2000 people often share one tap.

 3. 31% of our population has water infrastructure in their homes, but within that group,

 4. 45% face non-functional systems due to issues with pipes, pumps, and reservoirs. Towns like Amina, the rural parts of Amanzi, and a couple of towns across Akatsi and Hawassa have broken infrastructure.
     
 5. 18% of our people are using wells of which, but within that, only 28% are clean. These are mostly in Hawassa, Kilimani and Akatsi.

 6. Our citizens often face long wait times for water, averaging more than 120 minutes:
 Queues are very long on Saturdays.
 Queues are longer in the mornings and evenings.
 Wednesdays and Sundays have the shortest queues.

#  Plan of action

1. We want to focus our efforts on improving the water sources that affect the most people.
 Most people will benefit if we improve the shared taps first.

 2. Wells are a good source of water, but many are contaminated. Fixing this will benefit a lot of people.
     
 3. Fixing existing infrastructure will help many people. If they have running water again, they won't have to queue, thereby shorting queue times for others. So we can solve two problems at once.

 4. Installing taps in homes will stretch our resources too thin, so for now if the queue times are low, we won't improve that source.
 5. Most water sources are in rural areas. We need to ensure our teams know this as this means they will have to make these repairs/upgrades in
 rural areas where road conditions, supplies, and labour are harder challenges to overcome

# Practical solutions


 1. If communities are using rivers, we will dispatch trucks to those regions to provide water temporarily in the short term, while we send out
 crews to drill for wells, providing a more permanent solution. Sokoto is the first province we will target.

 2. If communities are using wells, we will install filters to purify the water. For chemically polluted wells, we can install reverse osmosis (RO)
 filters, and for wells with biological contamination, we can install UV filters that kill microorganisms- but we should install RO filters too. In
 the long term, we must figure out why these sources are polluted.

 3. For shared taps, in the short term, we can send additional water tankers to the busiest taps, on the busiest days. We can use the queue time
 pivot table we made to send tankers at the busiest times. Meanwhile, we can start the work on installing extra taps where they are needed.
 According to UN standards, the maximum acceptable wait time for water is 30 minutes. With this in mind, our aim is to install taps to get
 queue times below 30 min. Towns like Bello, Abidjan and Zuri have a lot of people using shared taps, so we will send out teams to those
 towns first.

 4. Shared taps with short queue times (< 30 min) represent a logistical challenge to further reduce waiting times. The most effective solution,
 installing taps in homes, is resource-intensive and better suited as a long-term goal.

 5. Addressing broken infrastructure offers a significant impact even with just a single intervention. It is expensive to fix, but so many people can
 benefit from repairing one facility. For example, fixing a reservoir or pipe that multiple taps are connected to. We identified towns like Amina,
 Lusaka, Zuri, Djenne and rural parts of Amanzi seem to be good places to start

# Create a Project progress table

In [ ]:
CREATE TABLE Project_progress (
Project_id SERIAL PRIMARY KEY,
source_id VARCHAR(20) NOT NULL REFERENCES water_source(source_id) ON DELETE CASCADE ON UPDATE CASCADE,
Address VARCHAR(50),
Town VARCHAR(30),
Province VARCHAR(30),
Source_type VARCHAR(50),
Improvement VARCHAR(50),
Source_status VARCHAR(50) DEFAULT 'Backlog' CHECK (Source_status IN ('Backlog', 'In progress', 'Complete')),
Date_of_completion DATE,
Comments TEXT
 );